Repository: athbss/wp-ai-bro
Catalog: languages/wordpress-ai-assistant-*.po
Languages: he_il

source: Testing connection...
he_il: בודק חיבור...

source: Connection successful!
he_il: חיבור הצליח!

source: Connection failed!
he_il: חיבור נכשל!

source: Saving...
he_il: שומר...

source: Settings saved!
he_il: הגדרות נשמרו!

source: Processing with AI...
he_il: מעבד עם AI...

source: AI processing completed!
he_il: עיבוד AI הושלם!

source: AI Assistant
he_il: עוזר AI

source: Settings
he_il: הגדרות

source: Usage & Costs
he_il: שימוש ועלויות

source: AI Playground
he_il: מגרש משחקים AI

source: Enable AI processing for this post
he_il: הפעל עיבוד AI לפוסט זה

source: Process with AI
he_il: עבד עם AI

source: This will generate tags, optimize content, and perform other AI enhancements.
he_il: פעולה זו תייצר תגיות, תבצע אופטימיזציה לתוכן, ותבצע שיפורי AI נוספים.

source: Insufficient permissions
he_il: אין הרשאות מספיקות

source: Security check failed
he_il: בדיקת אבטחה נכשלה

source: Invalid post ID
he_il: מזהה פוסט לא תקין

source: Post not found
he_il: פוסט לא נמצא

source: AI processing is not enabled for this post type
he_il: עיבוד AI לא מופעל עבור סוג פוסט זה

source: Post processed successfully with AI
he_il: פוסט עובד בהצלחה עם AI

source: Generate a concise excerpt (2-3 sentences) for the following content: %s
he_il: צור תקציר תמציתי (2-3 משפטים) לתוכן הבא: %s

source: General Settings
he_il: הגדרות כלליות

source: AI Providers
he_il: ספקי AI

source: AI Features
he_il: תכונות AI

source: Active Provider
he_il: ספק פעיל

source: Post Types with AI Assistant
he_il: סוגי פוסטים עם עוזר AI

source: Settings Saved
he_il: הגדרות נשמרו

source: WordPress AI Assistant Settings
he_il: הגדרות עוזר AI לוורדפרס

source: General
he_il: כללי

source: API Credentials
he_il: מפתחות API

source: Configure general settings for the AI Assistant plugin.
he_il: הגדר הגדרות כלליות לתוסף עוזר ה-AI.

source: Configure AI providers and their settings.
he_il: הגדר ספקי AI והגדרותיהם.

source: Enable or disable specific AI features.
he_il: הפעל או השבת תכונות AI ספציפיות.

source: Select the AI provider to use for all AI operations.
he_il: בחר את ספק ה-AI לשימוש בכל פעולות ה-AI.

source: Select which post types should have the AI assistant attached (meta box and automatic processing).
he_il: בחר אילו סוגי פוסטים יכללו את עוזר ה-AI (תיבת מטא ועיבוד אוטומטי).

source: Auto-generate alt text for images
he_il: צור טקסט חלופי אוטומטי לתמונות

source: Auto-tagging and categorization
he_il: תיוג וקיטלוג אוטומטי

source: Auto-generate excerpt
he_il: צור תקציר אוטומטי

source: Auto-create categories
he_il: צור קטגוריות אוטומטית

source: Auto-tag uploaded media
he_il: תייג מדיה מועלית אוטומטית

source: Enable or disable specific AI features globally.
he_il: הפעל או השבת תכונות AI ספציפיות בצורה גלובלית.

source: General Prompt Instructions
he_il: הנחיות כלליות לפרומפטים

source: Example: Write in a professional tone, use clear and concise language, avoid jargon...
he_il: דוגמה: כתוב בטון מקצועי, השתמש בשפה ברורה ותמציתית, הימנע מז'רגון...

source: These instructions will be automatically added to all AI prompts. Use this to define general writing style, tone, or content guidelines.
he_il: הנחיות אלו יתווספו אוטומטית לכל הפרומפטים של AI. השתמש בזה כדי להגדיר סגנון כתיבה כללי, טון, או הנחיות תוכן.

source: Visual Style Instructions
he_il: הנחיות סגנון ויזואלי

source: Example: Use modern, clean design style. Prefer vibrant colors. Maintain professional appearance...
he_il: דוגמה: השתמש בסגנון עיצובי מודרני ונקי. העדף צבעים תוססים. שמור על מראה מקצועי...

source: These instructions will be added to image generation prompts. Use this to define visual style, color schemes, design preferences, etc.
he_il: הנחיות אלו יתווספו לפרומפטים של יצירת תמונות. השתמש בזה כדי להגדיר סגנון ויזואלי, ערכות צבעים, העדפות עיצוב, וכו'.

source: Enter your %s API key.
he_il: הזן את מפתח ה-API של %s.

source: Test Connection
he_il: בדוק חיבור

source: Total Requests
he_il: סך בקשות

source: Total Tokens
he_il: סך טוקנים

source: Total Cost
he_il: עלות כוללת

source: Usage by Provider
he_il: שימוש לפי ספק

source: Provider
he_il: ספק

source: Requests
he_il: בקשות

source: Tokens
he_il: טוקנים

source: Cost
he_il: עלות

source: Avg Cost/Request
he_il: עלות ממוצעת לבקשה

source: Test AI Generation
he_il: בדיקת יצירת AI

source: Prompt
he_il: פרומפט

source: Enter your prompt here...
he_il: הזן את הפרומפט שלך כאן...

source: Max Tokens
he_il: מקסימום טוקנים

source: Generate
he_il: צור

source: Result
he_il: תוצאה

source: Results will appear here...
he_il: תוצאות יופיעו כאן...

source: Provider not specified
he_il: ספק לא צוין

source: Prompt cannot be empty
he_il: פרומפט לא יכול להיות ריק

source: AI provider not found
he_il: ספק AI לא נמצא

source: Translate the following text to %s (%s)
he_il: תרגם את הטקסט הבא ל-%s (%s)

source: from %s (%s)
he_il: מ-%s (%s)

source: Context:
he_il: הקשר:

source: The post is in %s, ensure the translation maintains the same tone and style.
he_il: הפוסט הוא ב-%s, וודא שהתרגום שומר על אותו טון וסגנון.

source: Translation:
he_il: תרגום:

source: IMPORTANT: The content is in %s (%s). Generate tags and categories in the same language.
he_il: חשוב: התוכן הוא ב-%s (%s). צור תגיות וקטגוריות באותה השפה.

source: Analyze the following content and suggest relevant tags and categories.
he_il: נתח את התוכן הבא והצע תגיות וקטגוריות רלוונטיות.

source: Content:
he_il: תוכן:

source: Available taxonomies:
he_il: טקסונומיות זמינות:

source: Suggest tags and categories in the following format:
he_il: הצע תגיות וקטגוריות בפורמט הבא:

source: Tags:
he_il: תגיות:

source: Categories:
he_il: קטגוריות:

source: Target Audience:
he_il: קהל יעד:

source: OpenAI API key is required
he_il: נדרש מפתח API של OpenAI

source: Invalid response from OpenAI API
he_il: תשובה לא תקינה מ-API של OpenAI

source: Anthropic API key is required
he_il: נדרש מפתח API של Anthropic

source: Invalid response from Anthropic API
he_il: תשובה לא תקינה מ-API של Anthropic

source: Google AI API key is required
he_il: נדרש מפתח API של Google AI

source: Invalid response from Google AI API
he_il: תשובה לא תקינה מ-API של Google AI

source: Invalid attachment
he_il: קובץ מצורף לא תקין

source: Alt text generated successfully
he_il: טקסט חלופי נוצר בהצלחה

source: Analyze this image and provide a concise, descriptive alt text that would be appropriate for accessibility purposes. Focus on the main subject, key elements, and context. Keep it under 125 characters. Do not include phrases like 'image of' or 'picture of' - just describe what's in the image directly.
he_il: נתח את התמונה הזו וספק טקסט חלופי תמציתי ומתאר שמתאים למטרות נגישות. התמקד בנושא הראשי, אלמנטים מרכזיים והקשר. שמור מתחת ל-125 תווים. אל תכלול ביטויים כמו 'תמונה של' או 'תמונה המציגה' - פשוט תאר מה יש בתמונה ישירות.

source: IMPORTANT: Generate the alt text in %s (%s).
he_il: חשוב: צור את הטקסט החלופי ב-%s (%s).

source: Tags generated and applied successfully
he_il: תגיות נוצרו והוחלו בהצלחה

source: No content found to analyze
he_il: לא נמצא תוכן לניתוח

source: Tags generated successfully
he_il: תגיות נוצרו בהצלחה

source: AI Generated Tags:
he_il: תגיות שנוצרו על ידי AI:

source: AI Tagging
he_il: תיוג AI

source: Generate Tags
he_il: צור תגיות

source: Apply Tags
he_il: החל תגיות

source: Preview:
he_il: תצוגה מקדימה:

source: Automatically generate and apply tags to posts on save
he_il: צור והחל תגיות אוטומטית לפוסטים בשמירה

source: When enabled, AI will analyze post content and automatically suggest relevant tags and categories.
he_il: כאשר מופעל, AI ינתח את תוכן הפוסט ויציע אוטומטית תגיות וקטגוריות רלוונטיות.

source: Automatically generate tags for uploaded images
he_il: צור תגיות אוטומטית לתמונות מועלות

source: When enabled, AI will analyze uploaded images and generate relevant tags based on image content.
he_il: כאשר מופעל, AI ינתח תמונות מועלות ויצור תגיות רלוונטיות על בסיס תוכן התמונה.

source: Text cannot be empty
he_il: טקסט לא יכול להיות ריק

source: Text translated successfully
he_il: טקסט תורגם בהצלחה

source: Detect the language of the following text and respond with only the language code (e.g., "en", "he", "es"). If you cannot determine the language, respond with "unknown". Text: %s
he_il: זהה את השפה של הטקסט הבא והשב רק עם קוד השפה (לדוגמה, "en", "he", "es"). אם לא ניתן לקבוע את השפה, השב עם "unknown". טקסט: %s

source: Target language is required
he_il: נדרשת שפת יעד

source: Language detected successfully
he_il: שפה זוהתה בהצלחה

source: Translating...
he_il: מתרגם...

source: Detecting language...
he_il: מזהה שפה...

source: Error occurred
he_il: אירעה שגיאה

source: Please enter text to translate
he_il: אנא הזן טקסט לתרגום

source: Please select target language
he_il: אנא בחר שפת יעד

source: AI Translation
he_il: תרגום AI

source: Enable AI translation for this post
he_il: הפעל תרגום AI לפוסט זה

source: Existing Translations:
he_il: תרגומים קיימים:

source: Quick translate to...
he_il: תרגום מהיר ל...

source: Translate
he_il: תרגם

source: IMPORTANT: Respond in %s (%s). All generated content must be in this language.
he_il: חשוב: השב ב-%s (%s). כל התוכן שנוצר חייב להיות בשפה זו.

source: API key is required
he_il: נדרש מפתח API

source: API request failed with code %d: %s
he_il: בקשת API נכשלה עם קוד %d: %s

source: Failed to decode API response
he_il: נכשל בפענוח תגובת API

source: Image generation not supported by this provider
he_il: יצירת תמונות לא נתמכת על ידי ספק זה

source: Unknown User
he_il: משתמש לא ידוע

source: Unknown Post
he_il: פוסט לא ידוע

source: Auto Tagging
he_il: תיוג אוטומטי

source: Auto Tag Media
he_il: תיוג מדיה אוטומטי

source: Please generate tags first
he_il: אנא צור תגיות תחילה

source: Tags applied successfully
he_il: תגיות הוחלו בהצלחה

source: Invalid tags data
he_il: נתוני תגיות לא תקינים

source: Object not found
he_il: אובייקט לא נמצא

source: Invalid object ID
he_il: מזהה אובייקט לא תקין

source: Generating tags...
he_il: יוצר תגיות...

source: Applying tags...
he_il: מחיל תגיות...

source: Please select a target language
he_il: אנא בחר שפת יעד

source: Please enter some content to translate
he_il: אנא הזן תוכן לתרגום

source: Translation completed! Check the translations list.
he_il: תרגום הושלם! בדוק את רשימת התרגומים.

source: Translation failed
he_il: תרגום נכשל

source: Network error occurred
he_il: אירעה שגיאת רשת

source: Processing failed
he_il: עיבוד נכשל

source: Try Again
he_il: נסה שוב

source: Generating...
he_il: יוצר...

source: Generated!
he_il: נוצר!

source: Generation failed
he_il: יצירה נכשלה

source: Failed to download image
he_il: נכשל בהורדת תמונה

source: Empty image data
he_il: נתוני תמונה ריקים

source: Default Model
he_il: מודל ברירת מחדל

source: Save failed
he_il: שמירה נכשלה

source: Hide
he_il: הסתר

source: Show
he_il: הצג

source: Cost ($)
he_il: עלות ($)

source: AI Usage Cost Over Time
he_il: עלות שימוש ב-AI לאורך זמן

source: Please enter a prompt
he_il: אנא הזן פרומפט

source: Image generation not supported by current provider
he_il: יצירת תמונות לא נתמכת על ידי הספק הנוכחי

source: System Status
he_il: מצב מערכת
